Revit 2027 API
IntersectingElementData.IntersectionType Property
 The intersection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IntersectionType IntersectionType { get; }
Public ReadOnly Property IntersectionType As IntersectionType
	Get
public:
property IntersectionType IntersectionType {
	IntersectionType get ();
}
member IntersectionType : IntersectionType with get
Property Value
IntersectionType
See Also
Reference
IntersectingElementData Class
Autodesk.Revit.DB Namespace